third.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="plaintexcss.css" />

This is a text editor in the style of Emacs. It has been written
from scratch in a literate form with help from Craig A. Finseth's
book [[https://www.finseth.com/craft/][The Craft of Text Editing --or-- Emacs for the Modern World]].

Our motivation is to be able to learn how a actually-usable non-toy
text editor works by reading the source code and commentary in a
narrative fashion. At certain points along the way we will have a
working editor that can be tangled, compiled, and run. Over time
certain parts will be enhanced or replaced with something more
advanced. The intent is for the reader take a bit at a time and not
forced to choose between either grokking whole complexity all at one
or seeing non-working toy parts.

We will start with a discussion and definition of buffers as this is a
foundational concept in Emacs. We will turn this simple buffer into an
editor by adding: 1. The ability to add a character to the buffer one
at a time, 2. The ability to transform the buffer into something that
can be seen, and 3. The ability to read in input from the user.

Next we will turn out editor into something that takes control of the
whole screen by using [[https://github.com/floooh/sokol][Sokol]] to provide cross-platform access to the
graphical display subsystems of our operating system.

At this point we know have full control over our display so we can
add the following features:

- Typeset characters in their proper place
- Add a status bar to the bottom
- Make a cursor

** Buffers

Everything is a buffer. That statement is not quite true, but it's
true enough. Files that we edit are loading into a buffer. When we
start a new file we start with an empty buffer and later bind it to
and save it to a file. Commands are typed into a (mini-) buffer.
Background status is stored in buffers. This is the magic that makes
Emacs so hackable.

A text file is a one-dimensional representation of a two-dimensional
document. For example, newlines are control characters that describe
how to convert the file into the 2d plane of glyphs.

This is an important point to remember. There's nothing sacred about
drawing one character at a time, from left to right, and when we get
to the right of the display wrapping to the next line by moving down
the glyph height and starting again at the far left and doing the
same when we reach a newline character instead of drawing it.

Painting a sequence of glyphs across the screen in a zig-zag is pretty
universal for text, but the direction you move isn't.

In fact, we will almost certainly want to visualize a sequence of
characters in different ways. For example: wrapping long lines vs
truncation.

And this brings up another difference, do we want the cursor to move
around the screen without any regard to the structure of the text
under it or does "move up" for example really mean move to the
previous line at the same column offset? And what happens if the
previous line is too short and doesn't have that column? And what
happens if you keep moving up and encounter another line that /is/
long enough? 

Mentally de-coupling the sequence of characters in a buffer with the
visualization opens up other potential improvements. Maybe we can also
display a PDF as either the textual format or as the drawn document
the author intended. Or we could constrain code files to always be
syntactically correct.

*** Buffer Representation

The choice of data structure for a buffer of text is dependent several
factors most notably how much text, whether it is full of many short
lines or few long lines, and whether it will be mostly just read or is
under active editing.

We recognized that we don't have to use the same data structure for
all active buffer nor even the same data structure for the buffer over
its lifetime.

**** Gap Buffers

In the actual implementation they use Gap Buffers. A buffer
initial starts off all gap, the first part is 0 length at
the beginning and the second part is 0 length at the end.

**** Naïve Buffer

Before we implement the more complex gap buffer we will
implement the most naïve form of buffer. Just a flat piece
of memory that comes from malloc. We move everything after
the insertion point with ~memmove~ during each edit.

#+name: buffer_representation
#+begin_src c
typedef struct Buffer {
  BufferId id;
  String name;
  u8* contents;
  u64 length;
  u64 point;
  // Mark mark; no need to this quite yet
  
} Buffer;

Buffer buffers[64];
u16 buffers_len;
BufferId current_buffer_id;
#+end_src

*** Create a new buffer

#+name: create_buffer
#+begin_src c
Status create_buffer(String name) {
  for (int i = 0; i < buffers_len; i++) {
    if (memcmp(buffers[i].name.s, name.s, name.len) == 0) {
      return Failure;
    }
  }
  int i = buffers_len++;
  Buffer * b = &buffers[i];
  b->id = i;
  b->name = name;
  b->contents = malloc(100);
  return Success;
}

Status set_current_buffer(String name) {
  for (int i = 0; i < buffers_len; i++) {
    if (memcmp(buffers[i].name.s, name.s, name.len) == 0) {
      current_buffer_id = i;
    }
  }
  return Failure;
}
#+end_src

