third.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-25 Sat 14:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Guido Bartolucci" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="plaintexcss.css" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org099b3fa">1. Buffers</a>
<ul>
<li><a href="#org91ea394">1.1. Buffer Representation</a>
<ul>
<li><a href="#org4fb89b3">1.1.1. Gap Buffers</a></li>
<li><a href="#orgda9f995">1.1.2. Naïve Buffer</a></li>
</ul>
</li>
<li><a href="#orgbcb1df7">1.2. Create a new buffer</a></li>
<li><a href="#orgce1ebae">1.3. Insert a character</a></li>
</ul>
</li>
<li><a href="#orgc160d77">2. Events</a>
<ul>
<li><a href="#org7e1e06f">2.1. Initialize Everything</a></li>
<li><a href="#orgcee8680">2.2. Load Fonts</a></li>
<li><a href="#orgdeb1819">2.3. Handle Event</a></li>
</ul>
</li>
<li><a href="#org88405ca">3. Display</a>
<ul>
<li><a href="#org40ba986">3.1. Typeset Buffer</a></li>
<li><a href="#org12da4f4">3.2. Display State</a></li>
<li><a href="#orgafe7ad7">3.3. Draw Frame</a></li>
</ul>
</li>
<li><a href="#orgb587aa5">4. TextMode vs Graphics</a>
<ul>
<li><a href="#orgfead18b">4.1. Unicode Helpers</a></li>
</ul>
</li>
<li><a href="#orgc77a0b8">5. Extensions</a>
<ul>
<li><a href="#org82d653e">5.1. Lisp Nodes</a></li>
</ul>
</li>
<li><a href="#org597dd8c">6. Stupid Ideas</a></li>
<li><a href="#orgf6933cd">7. Questions</a></li>
</ul>
</div>
</div>
<p>
This is a text editor in the style of Emacs. It has been written
from scratch in a literate form with help from Craig A. Finseth&rsquo;s
book <a href="https://www.finseth.com/craft/">The Craft of Text Editing &#x2013;or&#x2013; Emacs for the Modern World</a>.
</p>

<p>
Our motivation is to be able to learn how a actually-usable non-toy
text editor works by reading the source code and commentary in a
narrative fashion. At certain points along the way we will have a
working editor that can be tangled, compiled, and run. Over time
certain parts will be enhanced or replaced with something more
advanced. The intent is for the reader take a bit at a time and not
forced to choose between either grokking whole complexity all at one
or seeing non-working toy parts.
</p>

<p>
We will start with a discussion and definition of buffers as this is a
foundational concept in Emacs. We will turn this simple buffer into an
editor by adding: 1. The ability to add a character to the buffer one
at a time, 2. The ability to transform the buffer into something that
can be seen, and 3. The ability to read in input from the user.
</p>

<p>
Next we will turn out editor into something that takes control of the
whole screen by using <a href="https://github.com/floooh/sokol">Sokol</a> to provide cross-platform access to the
graphical display subsystems of our operating system.
</p>

<p>
At this point we know have full control over our display so we can
add the following features:
</p>

<ul class="org-ul">
<li>Typeset characters in their proper place</li>
<li>Add a status bar to the bottom</li>
<li>Make a cursor</li>
</ul>

<div id="outline-container-org099b3fa" class="outline-2">
<h2 id="org099b3fa"><span class="section-number-2">1.</span> Buffers</h2>
<div class="outline-text-2" id="text-1">
<p>
Everything is a buffer. That statement is not quite true, but it&rsquo;s
true enough. Files that we edit are loading into a buffer. When we
start a new file we start with an empty buffer and later bind it to
and save it to a file. Commands are typed into a (mini-) buffer.
Background status is stored in buffers. This is the magic that makes
Emacs so hackable.
</p>

<p>
A text file is a one-dimensional representation of a two-dimensional
document. For example, newlines are control characters that describe
how to convert the file into the 2d plane of glyphs.
</p>

<p>
This is an important point to remember. There&rsquo;s nothing sacred about
drawing one character at a time, from left to right, and when we get
to the right of the display wrapping to the next line by moving down
the glyph height and starting again at the far left and doing the
same when we reach a newline character instead of drawing it.
</p>

<p>
Painting a sequence of glyphs across the screen in a zig-zag is pretty
universal for text, but the direction you move isn&rsquo;t.
</p>

<p>
In fact, we will almost certainly want to visualize a sequence of
characters in different ways. For example: wrapping long lines vs
truncation.
</p>

<p>
And this brings up another difference, do we want the cursor to move
around the screen without any regard to the structure of the text
under it or does &ldquo;move up&rdquo; for example really mean move to the
previous line at the same column offset? And what happens if the
previous line is too short and doesn&rsquo;t have that column? And what
happens if you keep moving up and encounter another line that <i>is</i>
long enough? 
</p>

<p>
Mentally de-coupling the sequence of characters in a buffer with the
visualization opens up other potential improvements. Maybe we can also
display a PDF as either the textual format or as the drawn document
the author intended. Or we could constrain code files to always be
syntactically correct.
</p>
</div>

<div id="outline-container-org91ea394" class="outline-3">
<h3 id="org91ea394"><span class="section-number-3">1.1.</span> Buffer Representation</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The choice of data structure for a buffer of text is dependent several
factors most notably how much text, whether it is full of many short
lines or few long lines, and whether it will be mostly just read or is
under active editing.
</p>

<p>
We recognized that we don&rsquo;t have to use the same data structure for
all active buffer nor even the same data structure for the buffer over
its lifetime.
</p>
</div>

<div id="outline-container-org4fb89b3" class="outline-4">
<h4 id="org4fb89b3"><span class="section-number-4">1.1.1.</span> Gap Buffers</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
In the actual implementation they use Gap Buffers. A buffer
initial starts off all gap, the first part is 0 length at
the beginning and the second part is 0 length at the end.
</p>
</div>
</div>

<div id="outline-container-orgda9f995" class="outline-4">
<h4 id="orgda9f995"><span class="section-number-4">1.1.2.</span> Naïve Buffer</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Before we implement the more complex gap buffer we will
implement the most naïve form of buffer. Just a flat piece
of memory that comes from malloc. We move everything after
the insertion point with <code>memmove</code> during each edit.
</p>

<div class="org-src-container">
<pre class="src src-c" id="orga914262">typedef struct Buffer {
  BufferId id;
  String name;
  u8* contents;
  u64 length;
  u64 point;
  // Mark mark; no need to this quite yet
  
} Buffer;

Buffer buffers[64];
u16 buffers_len;
BufferId current_buffer_id;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbcb1df7" class="outline-3">
<h3 id="orgbcb1df7"><span class="section-number-3">1.2.</span> Create a new buffer</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-c" id="orgc958ad2">Status create_buffer(String name) {
  for (int i = 0; i &lt; buffers_len; i++) {
    if (memcmp(buffers[i].name.s, name.s, name.len) == 0) {
      return Failure;
    }
  }
  int i = buffers_len++;
  Buffer * b = &amp;buffers[i];
  b-&gt;id = i;
  b-&gt;name = name;
  b-&gt;contents = malloc(100);
  return Success;
}

Status set_current_buffer(String name) {
  for (int i = 0; i &lt; buffers_len; i++) {
    if (memcmp(buffers[i].name.s, name.s, name.len) == 0) {
      current_buffer_id = i;
    }
  }
  return Failure;
}
</pre>
</div>
</div>
</div>
