third.org
*** Insert a character

Insert the character that has been typed.

The universal argument is assumed to be the number of times to repeat
the character being inserted.

#+name: insert_char
#+begin_src c
Status insert_char(u32 ch) {
  u8 * b = buffers[current_buffer_id].contents;
  u64 loc = buffers[current_buffer_id].point;
  printf("Inserting %d to location %llu\n", ch, loc);
  u8 enc[4];
  u8 n = to_utf8(enc, ch);
  if (n == 0) return NotUnicode;
  memmove(b+loc+n, b+loc, n);
  memcpy(b+loc, enc, n);
  buffers[current_buffer_id].point++;
  buffers[current_buffer_id].length += n;
  return Success;
}
#+end_src

** Events

Now we move on to the human scale. This is where we react to keys
being pressed or being told that we need to re-draw the display.

*** Initialize Everything

#+name: init
#+begin_src c :noweb yes
static void init(void) {
  create_buffer(str("*scratch*"));
  set_current_buffer(str("*scratch*"));

  state.dpi_scale = sapp_dpi_scale();
  sg_setup(&(sg_desc){.context = sapp_sgcontext(), .logger.func = slog_func});
  __dbgui_setup(sapp_sample_count());
  sgl_setup(&(sgl_desc_t){.logger.func = slog_func});

  // make sure the fontstash atlas width/height is pow-2
  const int atlas_dim = round_pow2(512.0f * state.dpi_scale);
  state.fons = sfons_create(&(sfons_desc_t){.width = atlas_dim, .height = atlas_dim});
  state.font_mono = FONS_INVALID;
  state.font_normal = FONS_INVALID;

  <<load_fonts>>
}

#+end_src

*** Load Fonts

#+name: load_fonts
#+begin_src c
  sfetch_setup(&(sfetch_desc_t){
      .num_channels = 1,
      .num_lanes = 4,
      .logger.func = slog_func,
  });
  sfetch_send(&(sfetch_request_t){
      .path = "/Users/guido/Library/Fonts/MinionPro-Regular.otf",
      .callback = font_normal_loaded,
      .buffer = SFETCH_RANGE(state.font_normal_data),
  });
  sfetch_send(&(sfetch_request_t){
      .path = "/Users/guido/Library/Fonts/Hack Regular Nerd Font Complete.ttf",
      .callback = font_mono_loaded,
      .buffer = SFETCH_RANGE(state.font_mono_data),
  });
#+end_src


#+name: save_font_data
#+begin_src c
void font_mono_loaded(const sfetch_response_t* response) {
  printf("Loading mono\n");
  if (response->fetched) {
    printf("Loaded mono\n");
    state.font_mono = fonsAddFontMem(state.fons, "mono", (void*)response->data.ptr, (int)response->data.size,  false);
  }
  else if (response->failed) {
    printf("Loading mono failed: %d\n", response->error_code);
  }
}

void font_normal_loaded(const sfetch_response_t* response) {
  printf("Loading normal\n");
  if (response->fetched) {
    printf("Loaded normal\n");
    state.font_normal = fonsAddFontMem(state.fons, "sans", (void*)response->data.ptr, (int)response->data.size,  false);
  }
}
#+end_src


*** Handle Event

This is what happens when something like a key is pressed or the
window is re-sized.

#+name: handle_event
#+begin_src c
void handle_event(const sapp_event* event) {
  // SAPP_EVENTTYPE_KEY_DOWN
  // SAPP_EVENTTYPE_KEY_UP
  if (event->type == SAPP_EVENTTYPE_CHAR) {
    insert_char(event->char_code);
    // bool key_repeat;
    // uint32_t modifiers;
  }
}
#+end_src

** Display

