third.html

<div id="outline-container-orgce1ebae" class="outline-3">
<h3 id="orgce1ebae"><span class="section-number-3">1.3.</span> Insert a character</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Insert the character that has been typed.
</p>

<p>
The universal argument is assumed to be the number of times to repeat
the character being inserted.
</p>

<div class="org-src-container highlight">
  <pre class="src src-c" id="orga3e46fa"><span></span><span class="n">Status</span><span class="w"> </span><span class="nf">insert_char</span><span class="p">(</span><span class="n">u32</span><span class="w"> </span><span class="n">ch</span><span class="p">)</span><span class="w"> </span><span class="p">{</span><span class="w"></span>
<span class="w">  </span><span class="n">u8</span><span class="w"> </span><span class="o">*</span><span class="w"> </span><span class="n">b</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">buffers</span><span class="p">[</span><span class="n">current_buffer_id</span><span class="p">].</span><span class="n">contents</span><span class="p">;</span><span class="w"></span>
<span class="w">  </span><span class="n">u64</span><span class="w"> </span><span class="n">loc</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">buffers</span><span class="p">[</span><span class="n">current_buffer_id</span><span class="p">].</span><span class="n">point</span><span class="p">;</span><span class="w"></span>
<span class="w">  </span><span class="n">printf</span><span class="p">(</span><span class="s">&quot;Inserting %d to location %llu</span><span class="se">\n</span><span class="s">&quot;</span><span class="p">,</span><span class="w"> </span><span class="n">ch</span><span class="p">,</span><span class="w"> </span><span class="n">loc</span><span class="p">);</span><span class="w"></span>
<span class="w">  </span><span class="n">u8</span><span class="w"> </span><span class="n">enc</span><span class="p">[</span><span class="mi">4</span><span class="p">];</span><span class="w"></span>
<span class="w">  </span><span class="n">u8</span><span class="w"> </span><span class="n">n</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">to_utf8</span><span class="p">(</span><span class="n">enc</span><span class="p">,</span><span class="w"> </span><span class="n">ch</span><span class="p">);</span><span class="w"></span>
<span class="w">  </span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="n">n</span><span class="w"> </span><span class="o">==</span><span class="w"> </span><span class="mi">0</span><span class="p">)</span><span class="w"> </span><span class="k">return</span><span class="w"> </span><span class="n">NotUnicode</span><span class="p">;</span><span class="w"></span>
<span class="w">  </span><span class="n">memmove</span><span class="p">(</span><span class="n">b</span><span class="o">+</span><span class="n">loc</span><span class="o">+</span><span class="n">n</span><span class="p">,</span><span class="w"> </span><span class="n">b</span><span class="o">+</span><span class="n">loc</span><span class="p">,</span><span class="w"> </span><span class="n">n</span><span class="p">);</span><span class="w"></span>
<span class="w">  </span><span class="n">memcpy</span><span class="p">(</span><span class="n">b</span><span class="o">+</span><span class="n">loc</span><span class="p">,</span><span class="w"> </span><span class="n">enc</span><span class="p">,</span><span class="w"> </span><span class="n">n</span><span class="p">);</span><span class="w"></span>
<span class="w">  </span><span class="n">buffers</span><span class="p">[</span><span class="n">current_buffer_id</span><span class="p">].</span><span class="n">point</span><span class="o">++</span><span class="p">;</span><span class="w"></span>
<span class="w">  </span><span class="n">buffers</span><span class="p">[</span><span class="n">current_buffer_id</span><span class="p">].</span><span class="n">length</span><span class="w"> </span><span class="o">+=</span><span class="w"> </span><span class="n">n</span><span class="p">;</span><span class="w"></span>
<span class="w">  </span><span class="k">return</span><span class="w"> </span><span class="n">Success</span><span class="p">;</span><span class="w"></span>
<span class="p">}</span><span class="w"></span>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc160d77" class="outline-2">
<h2 id="orgc160d77"><span class="section-number-2">2.</span> Events</h2>
<div class="outline-text-2" id="text-2">
<p>
Now we move on to the human scale. This is where we react to keys
being pressed or being told that we need to re-draw the display.
</p>
</div>

<div id="outline-container-org7e1e06f" class="outline-3">
<h3 id="org7e1e06f"><span class="section-number-3">2.1.</span> Initialize Everything</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-c" id="org995fdb1">static void init(void) {
  create_buffer(str("*scratch*"));
  set_current_buffer(str("*scratch*"));

  state.dpi_scale = sapp_dpi_scale();
  sg_setup(&amp;(sg_desc){.context = sapp_sgcontext(), .logger.func = slog_func});
  __dbgui_setup(sapp_sample_count());
  sgl_setup(&amp;(sgl_desc_t){.logger.func = slog_func});

  // make sure the fontstash atlas width/height is pow-2
  const int atlas_dim = round_pow2(512.0f * state.dpi_scale);
  state.fons = sfons_create(&amp;(sfons_desc_t){.width = atlas_dim, .height = atlas_dim});
  state.font_mono = FONS_INVALID;
  state.font_normal = FONS_INVALID;

    sfetch_setup(&amp;(sfetch_desc_t){
        .num_channels = 1,
        .num_lanes = 4,
        .logger.func = slog_func,
    });
    sfetch_send(&amp;(sfetch_request_t){
        .path = "/Users/guido/Library/Fonts/MinionPro-Regular.otf",
        .callback = font_normal_loaded,
        .buffer = SFETCH_RANGE(state.font_normal_data),
    });
    sfetch_send(&amp;(sfetch_request_t){
        .path = "/Users/guido/Library/Fonts/Hack Regular Nerd Font Complete.ttf",
        .callback = font_mono_loaded,
        .buffer = SFETCH_RANGE(state.font_mono_data),
    });
}

</pre>
</div>
</div>
</div>

<div id="outline-container-orgcee8680" class="outline-3">
<h3 id="orgcee8680"><span class="section-number-3">2.2.</span> Load Fonts</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-c" id="org5ad74b3">  sfetch_setup(&amp;(sfetch_desc_t){
      .num_channels = 1,
      .num_lanes = 4,
      .logger.func = slog_func,
  });
  sfetch_send(&amp;(sfetch_request_t){
      .path = "/Users/guido/Library/Fonts/MinionPro-Regular.otf",
      .callback = font_normal_loaded,
      .buffer = SFETCH_RANGE(state.font_normal_data),
  });
  sfetch_send(&amp;(sfetch_request_t){
      .path = "/Users/guido/Library/Fonts/Hack Regular Nerd Font Complete.ttf",
      .callback = font_mono_loaded,
      .buffer = SFETCH_RANGE(state.font_mono_data),
  });
</pre>
</div>


<div class="org-src-container">
<pre class="src src-c" id="orge60605a">void font_mono_loaded(const sfetch_response_t* response) {
  printf("Loading mono\n");
  if (response-&gt;fetched) {
    printf("Loaded mono\n");
    state.font_mono = fonsAddFontMem(state.fons, "mono", (void*)response-&gt;data.ptr, (int)response-&gt;data.size,  false);
  }
  else if (response-&gt;failed) {
    printf("Loading mono failed: %d\n", response-&gt;error_code);
  }
}

void font_normal_loaded(const sfetch_response_t* response) {
  printf("Loading normal\n");
  if (response-&gt;fetched) {
    printf("Loaded normal\n");
    state.font_normal = fonsAddFontMem(state.fons, "sans", (void*)response-&gt;data.ptr, (int)response-&gt;data.size,  false);
  }
}
</pre>
</div>
</div>
</div>


<div id="outline-container-orgdeb1819" class="outline-3">
<h3 id="orgdeb1819"><span class="section-number-3">2.3.</span> Handle Event</h3>
<div class="outline-text-3" id="text-2-3">
<p>
This is what happens when something like a key is pressed or the
window is re-sized.
</p>

<div class="org-src-container">
<pre class="src src-c" id="orgb2667a0">void handle_event(const sapp_event* event) {
  // SAPP_EVENTTYPE_KEY_DOWN
  // SAPP_EVENTTYPE_KEY_UP
  if (event-&gt;type == SAPP_EVENTTYPE_CHAR) {
    insert_char(event-&gt;char_code);
    // bool key_repeat;
    // uint32_t modifiers;
  }
}
</pre>
</div>
</div>
</div>
</div>
