third.org
*** Typeset Buffer

This is where we translate the one-dimensional buffer into our
two-dimensional display. In anticipation of the later addition of
"windows" we will provide the ability to typeset a buffer into any
size. We will go ahead an call the display a window for now. In fact,
it makes sense to think of a window as a view into the buffer. You
aren't necessarily going to see the whole thing.

If the buffer typesets into something smaller than the window then our
job is very easy. It gets more complicated when we have to figure out
where to place the point and then determine how far back to start
from.

Let's try to describe the typesetting algorithm for a large buffer
and then see if that also solves our simple case.

The point is obviously kept as part as an index into the buffer. It's
also something visual, a cursor that has a location in the window.
This relationship must be the heart of our algorithm. Let's start
by defining our Window type.

#+name: window
#+begin_src c :noweb yes
typedef struct Window {
  u16_pair size_in_pixels;  // in pixels
  u16_pair size_in_chars;   // in characters
  u16_pair cursor_location; // in characters
  <<window_additions>>
} Window;
#+end_src

Now we need to determine which location in the buffer represents the
first character of the first line in our window. The naïve approach is
what we will do first. Let's just typeset everything from the
beginning of the buffer until our current location. Actually, it's
simpler than that. We just need to keep track of the locations in the
buffer that represent the beginnings of lines.

- [ ] TODO: It would be cool to be able to show the outside of the buffer struct sorta dimed giving the new code here some context
- [ ] TODO: We should also allow you to click on a snippet and see it all merged together

#+name: buffer_additions
#+begin_src c
u64 line_count;
u64 * line_starts;
#+end_src

#+name: create_buffer_additions
#+begin_src c
b->line_starts = malloc(4096*sizeof(u64));
#+end_src

#+name: calculate_line_starts
#+begin_src c
for (u64 i = 0; i < b->length; i++) {
  
}
#+end_src



*** Display State
#+name: display_state
#+begin_src c
typedef struct {
  FONScontext* fons;
  float dpi_scale;
  int font_mono;
  int font_normal;
  uint8_t font_mono_data[16 * 256 * 1024];
  uint8_t font_normal_data[256 * 1024];
} state_t;
static state_t state;
#+end_src

*** Draw Frame

#+name: draw_frame
#+begin_src c
static void draw_frame(void) {
  const char * str = (const char *)buffers[current_buffer_id].contents;
  const float dpis = state.dpi_scale;

  // pump sokol_fetch message queues (GUIDO: why?)
  sfetch_dowork();

  float sx, sy, dx, dy, lh = 0.0f;
  uint32_t white = sfons_rgba(255, 255, 255, 255);
  fonsClearState(state.fons);

  sgl_defaults();
  sgl_matrix_mode_projection();
  sgl_ortho(0.0f, sapp_widthf(), sapp_heightf(), 0.0f, -1.0f, +1.0f);

  sx = 50*dpis; sy = 50*dpis;
  dx = sx; dy = sy;

  FONScontext* fs = state.fons;
  fonsSetFont(fs, state.font_normal);
  fonsSetSize(fs, 124.0f*dpis);
  fonsVertMetrics(fs, NULL, NULL, &lh);
  dx = sx;
  dy += lh;
  fonsSetColor(fs, white);
  dx = fonsDrawText(fs, dx, dy, str, NULL);

  // Draw status line
  line(0, sapp_heightf()-100, sapp_widthf(), sapp_heightf()-100);
  fonsSetFont(fs, state.font_mono);
  fonsSetSize(fs, 48.0f*dpis);
  dx = fonsDrawText(fs, 0, sapp_heightf()-24, "U:**-  *scratch*  0% (0,0)", NULL);
  
  // flush fontstash's font atlas to sokol-gfx texture
  sfons_flush(fs);

  // render pass
  sg_begin_default_pass(&(sg_pass_action){
      .colors[0] = {
        .action = SG_ACTION_CLEAR, .value = { 0.3f, 0.3f, 0.32f, 1.0f }
      }
    }, sapp_width(), sapp_height());
  sgl_draw();
  __dbgui_draw();
  sg_end_pass();
  sg_commit();
}
#+end_src


