third.html

<div id="outline-container-org88405ca" class="outline-2">
<h2 id="org88405ca"><span class="section-number-2">3.</span> Display</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org40ba986" class="outline-3">
<h3 id="org40ba986"><span class="section-number-3">3.1.</span> Typeset Buffer</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This is where we translate the one-dimensional buffer into our
two-dimensional display. In anticipation of the later addition of
&ldquo;windows&rdquo; we will provide the ability to typeset a buffer into any
size. We will go ahead an call the display a window for now. In fact,
it makes sense to think of a window as a view into the buffer. You
aren&rsquo;t necessarily going to see the whole thing.
</p>

<p>
If the buffer typesets into something smaller than the window then our
job is very easy. It gets more complicated when we have to figure out
where to place the point and then determine how far back to start
from.
</p>

<p>
Let&rsquo;s try to describe the typesetting algorithm for a large buffer
and then see if that also solves our simple case.
</p>

<p>
The point is obviously kept as part as an index into the buffer. It&rsquo;s
also something visual, a cursor that has a location in the window.
This relationship must be the heart of our algorithm. Let&rsquo;s start
by defining our Window type.
</p>

<div class="org-src-container">
<pre class="src src-c" id="orgaeeb81b">typedef struct Window {
  u16_pair size_in_pixels;  // in pixels
  u16_pair size_in_chars;   // in characters
  u16_pair cursor_location; // in characters
  
} Window;
</pre>
</div>

<p>
Now we need to determine which location in the buffer represents the
first character of the first line in our window. The naïve approach is
what we will do first. Let&rsquo;s just typeset everything from the
beginning of the buffer until our current location. Actually, it&rsquo;s
simpler than that. We just need to keep track of the locations in the
buffer that represent the beginnings of lines.
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> TODO: It would be cool to be able to show the outside of the buffer struct sorta dimed giving the new code here some context</li>
<li class="off"><code>[&#xa0;]</code> TODO: We should also allow you to click on a snippet and see it all merged together</li>
</ul>

<div class="org-src-container">
<pre class="src src-c" id="org328c63d">u64 line_count;
u64 * line_starts;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c" id="orgfbc91b2">b-&gt;line_starts = malloc(4096*sizeof(u64));
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c" id="orgef84a22">for (u64 i = 0; i &lt; b-&gt;length; i++) {
  
}
</pre>
</div>
</div>
</div>



<div id="outline-container-org12da4f4" class="outline-3">
<h3 id="org12da4f4"><span class="section-number-3">3.2.</span> Display State</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-c" id="org112bcfa">typedef struct {
  FONScontext* fons;
  float dpi_scale;
  int font_mono;
  int font_normal;
  uint8_t font_mono_data[16 * 256 * 1024];
  uint8_t font_normal_data[256 * 1024];
} state_t;
static state_t state;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgafe7ad7" class="outline-3">
<h3 id="orgafe7ad7"><span class="section-number-3">3.3.</span> Draw Frame</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-c" id="org029bfd0">static void draw_frame(void) {
  const char * str = (const char *)buffers[current_buffer_id].contents;
  const float dpis = state.dpi_scale;

  // pump sokol_fetch message queues (GUIDO: why?)
  sfetch_dowork();

  float sx, sy, dx, dy, lh = 0.0f;
  uint32_t white = sfons_rgba(255, 255, 255, 255);
  fonsClearState(state.fons);

  sgl_defaults();
  sgl_matrix_mode_projection();
  sgl_ortho(0.0f, sapp_widthf(), sapp_heightf(), 0.0f, -1.0f, +1.0f);

  sx = 50*dpis; sy = 50*dpis;
  dx = sx; dy = sy;

  FONScontext* fs = state.fons;
  fonsSetFont(fs, state.font_normal);
  fonsSetSize(fs, 124.0f*dpis);
  fonsVertMetrics(fs, NULL, NULL, &amp;lh);
  dx = sx;
  dy += lh;
  fonsSetColor(fs, white);
  dx = fonsDrawText(fs, dx, dy, str, NULL);

  // Draw status line
  line(0, sapp_heightf()-100, sapp_widthf(), sapp_heightf()-100);
  fonsSetFont(fs, state.font_mono);
  fonsSetSize(fs, 48.0f*dpis);
  dx = fonsDrawText(fs, 0, sapp_heightf()-24, "U:**-  *scratch*  0% (0,0)", NULL);
  
  // flush fontstash's font atlas to sokol-gfx texture
  sfons_flush(fs);

  // render pass
  sg_begin_default_pass(&amp;(sg_pass_action){
      .colors[0] = {
        .action = SG_ACTION_CLEAR, .value = { 0.3f, 0.3f, 0.32f, 1.0f }
      }
    }, sapp_width(), sapp_height());
  sgl_draw();
  __dbgui_draw();
  sg_end_pass();
  sg_commit();
}
</pre>
</div>
</div>
</div>
</div>
